tap "browsh-org/browsh"
tap "gromgit/fuse"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "zegervdv/zathura"
brew "python@3.13"
brew "black"
brew "clang-format"
brew "coreutils"
brew "doxygen"
brew "flake8"
brew "gcc"
brew "git"
brew "grep"
brew "jq"
brew "node"
brew "jupyterlab"
brew "latexindent"
brew "libelf"
brew "libtensorflow"
brew "llvm@14"
brew "luacheck"
brew "neovim"
brew "numpy"
brew "pipx"
brew "prettier"
brew "pyenv"
brew "r"
brew "ripgrep"
brew "ruff"
brew "stylua"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-git-prompt"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "gromgit/fuse/sshfs-mac"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "zegervdv/zathura/girara", args: ["HEAD"]
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "alt-tab"
cask "basictex"
cask "firefox"
cask "font-bigblue-terminal-nerd-font"
cask "font-fira-code-nerd-font"
cask "karabiner-elements"
cask "kitty"
cask "macfuse"
cask "microsoft-auto-update"
cask "notion"
cask "notion-calendar"
cask "skim"
cask "visual-studio-code"
cask "xquartz"
vscode "avetis.tokyo-night"
vscode "github.github-vscode-theme"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
